app/controllers/categories_controller.rb

  def index
    @categories = Category.all
---
SELECT * FROM `categories`

  def create
    @category = Category.new(params[:category])
    if @category.save
---
INSERT INTO `categories` (`name`, `created_at`, `updated_at`) VALUES('baking', '2011-04-12 13:22:21', '2011-04-12 13:22:21')

  def edit
    @category = Category.find(params[:id])
---
SELECT * FROM `categories` WHERE (`categories`.`id` = 1)