app/controllers/products_controller.rb

SELECT * FROM `products`
SELECT * FROM `categories` WHERE (`categories`.`id` = 1)
---
  def index
    @cart = find_cart

    if params[:category].nil? || params[:category].blank?
      @products = Product.all
      @title = "All"
    else
      @category = Category.find(params[:category])

INSERT INTO `products` (`name`, `created_at`, `updated_at`, `category_id`, `description`) VALUES('prdocut', '2011-04-12 13:44:11', '2011-04-12 13:44:11', 3, 'product with category')
---
  def create
    @product = Product.new(params[:product])
    if @product.save

SELECT * FROM `products` WHERE (`products`.`id` = 1)
UPDATE `products` SET `updated_at` = '2011-04-12 13:35:54', `category_id` = 1 WHERE `id` = 1
---
  def update
    @product = Product.find(params[:id])
    if @product.update_attributes(params[:product])