app/controllers/stores_controller.rb

  def index
    @stores = Store.all
---
SELECT * FROM `stores`

  def show
    @store = Store.find(params[:id])
---
SELECT * FROM `stores` WHERE (`stores`.`id` = 1)

  def create
    @store = Store.new(params[:store])
    @user = @store.build_user(params[:user])
    if @store.save
---
INSERT INTO `stores` (`number`, `zip`, `created_at`, `district`, `updated_at`, `street`) VALUES('909', '12345', '2011-04-07 16:51:55', 'test disctrict', '2011-04-07 16:51:55', 'test st')
INSERT INTO `users` (`encrypted_password`, `salt`, `name`, `created_at`, `userable_id`, `userable_type`, `updated_at`, `admin`, `remember_token`, `email`) VALUES('5d811a17a1118f515f17b82e0e7e24854946a75e66c179c1604c6f4af40e5efa', '0d5d98f4db5d53a82a327e39802faf57f430625329f35408a575eb0b400393a2', 'store', '2011-04-12 05:25:38', 1, 'Store', '2011-04-12 05:25:38', NULL, NULL, 'store@store.com')

  def edit
    @store = Store.find(params[:id])
---
SELECT * FROM `stores` WHERE (`stores`.`id` = 1)

  def update
    @store = Store.find(params[:id])
    @user = User.find_by_userable_id(@store.id)
    if @store.update_attributes(params[:store]) and @user.update_attributes(params[:user])
---
SELECT * FROM `stores` WHERE (`stores`.`id` = 4)
SELECT * FROM `users` WHERE (`users`.userable_id = 4 AND `users`.userable_type = 'Store') LIMIT 1
UPDATE `stores` SET `updated_at` = '2011-04-08 06:07:49', `number` = '123677777', `zip` = '09876' WHERE `id` = 5
UPDATE `users` SET `updated_at` = '2011-04-07 17:47:06', `salt` = '8eb0c07ae89d9c0ba29493ae8eda9f9fc6d793afa870624e752efc665ff001df', `name` = 'frhgroi', `encrypted_password` = 'af48da798c2593dfbe92a6e5dfea05606dfc70745ddd250fbbdec3308175fc22' WHERE `id` = 6

  def destroy
    @store = Store.find(params[:id])
    @store.destroy
---
SELECT * FROM `stores` WHERE (`stores`.`id` = 2)
DELETE FROM `stores` WHERE `id` = 2

  def set_price_for_product
    store = Store.find(params[:storeproduct][:store_id])
---
SELECT * FROM `stores` WHERE (`stores`.`id` = 1)