app/controllers/users_controller.rb

  def create
    @user = User.new(params[:user])
    if @user.save
---
INSERT INTO `users` (`encrypted_password`, `salt`, `name`, `created_at`, `userable_id`, `userable_type`, `updated_at`, `admin`, `remember_token`, `email`) VALUES('87fb44baa06bc0285247639363382fbbc4f093a1f46120c51094cfd6c45d13c9', '35ee237de644d1b0e23b92284f3e184cbd7359ed43046d7671323c9728a24e29', 'kurenn', '2011-04-12 05:14:37', NULL, NULL, '2011-04-12 05:14:37', NULL, NULL, 'abraham.kuri@gmail.com')

  def update
    @user = User.find(params[:id])
    if @user.update_attributes(params[:user])
---
SELECT * FROM `users` WHERE (`users`.`id` = 1)
UPDATE `users` SET `updated_at` = '2011-04-04 14:38:39', `salt` = '4d4bd3ff5ae24bc24a91e4dac0ac348b28ceb5fcdcaea870c2f6a7c693972ec6', `name` = 'kurenn', `encrypted_password` = '02206757c80763e07ca41e41560042b4fd3245f211c59f35e700faefe61a3af6' WHERE `id` = 1